# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [1]:
# Your code here

# IMPORTING DATAFRAME

import pandas as pd

url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'

ins_df = pd.read_csv(url)
ins_df.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

In [2]:
# COLUMN NAMES CLEAN UP
ins_df.columns = [col.strip().replace(" ","_").lower() for col in ins_df.columns]
ins_df.head()

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [3]:
ins_df.rename(columns = {"st": "state"}, inplace = True)  # We use a dictionary
ins_df.head(3)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [4]:
# Your code here

# GENDER
print(f"""Before:
{ins_df["gender"].unique()}""")
print(ins_df["gender"].value_counts())

ins_df["gender"] = ins_df["gender"].apply(lambda x: "M" if x == "Male" else "F" if x == "Femal" or x == "female" else x)
print()

print(f"""After:
{ins_df["gender"].unique()}""")
print(ins_df["gender"].value_counts())

Before:
[nan 'F' 'M' 'Femal' 'Male' 'female']
gender
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64

After:
[nan 'F' 'M']
gender
F    502
M    452
Name: count, dtype: int64

In [5]:
# STATE
print(f"""Before:
{ins_df["state"].unique()}""")
print(ins_df["state"].value_counts())

ins_df["state"]=ins_df['state'].apply(lambda x: "Arizona" if x=="AZ" else "Washington" if x=="WA" else "California" if x=="Cali" else x)
print()

print(f"""After:
{ins_df["state"].unique()}""")
print(ins_df["state"].value_counts())

Before:
['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'Cali' 'AZ' 'WA'
 nan]
state
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64

After:
['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' nan]
state
California    331
Oregon        320
Arizona       211
Washington    111
Nevada         98
Name: count, dtype: int64

In [6]:
# EDUCATION
print(f"""Before:
{ins_df["education"].unique()}""")
print(ins_df["education"].value_counts())

ins_df["education"]=ins_df['education'].apply(lambda x: "Bachelor" if x=="Bachelors" else x)
print()

print(f"""After:
{ins_df["education"].unique()}""")
print(ins_df["education"].value_counts())

Before:
['Master' 'Bachelor' 'High School or Below' 'College' 'Bachelors' 'Doctor'
 nan]
education
Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: count, dtype: int64

After:
['Master' 'Bachelor' 'High School or Below' 'College' 'Doctor' nan]
education
Bachelor                331
College                 313
High School or Below    296
Master                   94
Doctor                   37
Name: count, dtype: int64

In [7]:
# CUSTOMER LIFETIME VALUE
print(ins_df["customer_lifetime_value"].dtypes)

# since the data type is an object we can use the replace method on the strings
ins_df["customer_lifetime_value"]=ins_df["customer_lifetime_value"].map(lambda x: x.replace("%","") if isinstance(x, str) else x)

ins_df.head()

object

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [8]:
# VEHICLE CLASS
print(f"""Before:
{ins_df["vehicle_class"].unique()}""")
print(ins_df["vehicle_class"].value_counts())

ins_df["vehicle_class"]=ins_df["vehicle_class"].apply(lambda x: "Luxury" if x=="Luxury SUV" or x=="Sports Car" or x=="Luxury Car" else x)
print()

print(f"""After:
{ins_df["vehicle_class"].unique()}""")
print(ins_df["vehicle_class"].value_counts())

Before:
['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car' nan]
vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Sports Car        57
Luxury SUV        20
Luxury Car        14
Name: count, dtype: int64

After:
['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury' nan]
vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Luxury            91
Name: count, dtype: int64

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [9]:
# Your code here

# CUSTOMER LIFETIME VALUE
print(f"""Data Type Before: {ins_df["customer_lifetime_value"].dtypes}""")

ins_df["customer_lifetime_value"]=ins_df["customer_lifetime_value"].apply(lambda x: float(x))
print()

print(f"""Data Type After: {ins_df["customer_lifetime_value"].dtypes}""")

Data Type Before: object

Data Type After: float64

In [10]:
# NUMBER OF OPEN COMPLAINTS
print(f"""Data Type Before: {ins_df["number_of_open_complaints"].dtypes}""")
print(ins_df["number_of_open_complaints"].unique())

ins_df["number_of_open_complaints"]=ins_df["number_of_open_complaints"].apply(lambda x: x.split("/")[1] if isinstance(x, str) else x)
ins_df["number_of_open_complaints"]=ins_df["number_of_open_complaints"].apply(lambda x: float(x))
print()

print(f"""Data Type Before: {ins_df["number_of_open_complaints"].dtypes}""")
print(ins_df["number_of_open_complaints"].unique())

Data Type Before: object
['1/0/00' '1/2/00' '1/1/00' '1/3/00' '1/5/00' '1/4/00' nan]

Data Type Before: float64
[ 0.  2.  1.  3.  5.  4. nan]

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [11]:
# Your code here
ins_df.isnull().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [12]:
# 1 - Dropping rows with null values on every column
ins_df.dropna(how="all",inplace=True)
ins_df.isnull().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [13]:
# 2 - GENDER
print(ins_df["gender"].value_counts())

# we have similar amounts of genders, so we can just fill the null values with the previous or next value and see if the distribution is similar
display(ins_df.head(2))
display(ins_df.tail(2))
# since the [0] is NaN and the [-1] is filled, we can do a "bfill" so it is all taken care in one go
ins_df["gender"]=ins_df["gender"].bfill()
ins_df["gender"].value_counts()

# yes, the proportion of females to males, increases but just slightly, it seems a valid way of doing it
# with the ffill() method that proportion would have increased even more, and we would need an extra step to deal with the first value of the series

gender
F    502
M    452
Name: count, dtype: int64

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1069,CW49887,California,F,Master,462680.11,79487.0,114.0,0.0,Special Auto,SUV,547.2
1070,MY31220,California,F,College,899704.02,54230.0,112.0,0.0,Personal Auto,Two-Door Car,537.6

gender
F    575
M    496
Name: count, dtype: int64

In [14]:
# 3 CUSTOMER LIFETIME VALUE
# in this case we only have 3 out of 1071 values missing, so it seems valid to substitute them with the mean of the series

print("Max", ins_df["customer_lifetime_value"].max())
print("Mean", ins_df["customer_lifetime_value"].mean())
print("Min", ins_df["customer_lifetime_value"].min())
print("Median", ins_df["customer_lifetime_value"].median())

Max 5816655.35
Mean 793690.2593445693
Min 200435.07
Median 588174.235

In [15]:
ins_df["customer_lifetime_value"].value_counts().head(20) # The most frequent values seem closer to the median, so that's how we'll replace the null values

customer_lifetime_value
445811.34     4
251459.20     4
272535.64     3
578018.22     3
684615.03     3
2412750.40    3
477294.38     3
272221.07     2
598977.39     2
907576.82     2
411858.86     2
758211.38     2
1215732.99    2
277104.50     2
388545.64     2
3347334.95    2
1017971.70    2
258240.85     2
2359468.02    2
239391.54     2
Name: count, dtype: int64

In [16]:
ins_df["customer_lifetime_value"] = ins_df["customer_lifetime_value"].fillna(ins_df["customer_lifetime_value"].median())

In [17]:
# 4 - CHECKING NULL VALUES
ins_df.isna().any()

customer                     False
state                        False
gender                       False
education                    False
customer_lifetime_value      False
income                       False
monthly_premium_auto         False
number_of_open_complaints    False
policy_type                  False
vehicle_class                False
total_claim_amount           False
dtype: bool

In [18]:
# 5 - CONVERTING NUMERIC VARIABLES TO INTEGER NUMBERS
ins_df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints    float64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [19]:
ins_df = ins_df.astype({"customer_lifetime_value":"int"})
ins_df = ins_df.astype({"income":"int"})
ins_df = ins_df.astype({"monthly_premium_auto":"int"})
ins_df = ins_df.astype({"number_of_open_complaints":"int"})
ins_df = ins_df.astype({"total_claim_amount":"int"})

In [20]:
ins_df.dtypes

customer                     object
state                        object
gender                       object
education                    object
customer_lifetime_value       int32
income                        int32
monthly_premium_auto          int32
number_of_open_complaints     int32
policy_type                  object
vehicle_class                object
total_claim_amount            int32
dtype: object

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [21]:
# Your code here
ins_df.duplicated().any()  # there aren's any duplicated rows in the dataframe

False

In [22]:
ins_df.to_csv("ins_df_ready.csv")

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [23]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [24]:
# Your code here